/*
5. Крисс-кросс 
Реализовать программу, которая по набору слов создает решетку кроссворда. 
Решетка должна быть компактная и красивая, а также иметь максимум пересечений. 
На вход программа берет список слов, на выходе записывает решетку в текстовый файл.
*/
#include "Header.h"
#include <iostream>

int main() { //переделать алгоритм. После того, как нашлось совпадение по букве, но слово не смогло вставиться, искать совпадение по следующей букве, с этими же словами
			 //проверить работу vertical и horiz check
	start();
	return 0;
}

