/*
5. Крисс-кросс 
Реализовать программу, которая по набору слов создает решетку кроссворда. 
Решетка должна быть компактная и красивая, а также иметь максимум пересечений. 
На вход программа берет список слов, на выходе записывает решетку в текстовый файл.
*/
#include "Header.h"
#include <iostream>

int main() { 
			// добавить проверку на слова меньше 3 или 4
			// добавить неограниченный ввод
			// .........добавить отчищение пустых строк - 1 (чтобы сохранялась обводка) (crisscross_reduction)
			// можно добавить класс матрицы
			// / не робит
	start();
	return 0;
}

