/*
5. Крисс-кросс 
Реализовать программу, которая по набору слов создает решетку кроссворда. 
Решетка должна быть компактная и красивая, а также иметь максимум пересечений. 
На вход программа берет список слов, на выходе записывает решетку в текстовый файл.
*/
#include "Header.h"
#include <iostream>

int main() { //переделать алгоритм. Нужно переделать алгоритм, чтобы выбирало лучший по пересечениям вариант (поработать с функцией). Можно добавить приоритет (от центра)
			 //проверить работу vertical и horiz check
	start();
	return 0;
}

